# -----------------------------------'
# Installing casks...
# -----------------------------------'

# Password manager that keeps all passwords secure behind one password
cask '1password'

# Command-line interface for 1Password
cask '1password-cli'

# Enable Windows-like alt-tab
cask 'alt-tab'

# Japanese input method editor (IME) produced by JustSystems
cask 'atok'

# Voice and text chat software
cask 'discord'

# App to build and share containerised applications and microservices
cask 'docker'

# Client for the Dropbox cloud storage service
cask 'dropbox'

# UI toolkit for building applications for mobile, web and desktop
cask 'flutter'

# Web browser
cask 'google-chrome'

# Set of tools to manage resources and applications hosted on Google Cloud
cask 'google-cloud-sdk'

# Control your tools with a few keystrokes
cask 'raycast'

# Video chat, voice call and instant messaging application
cask 'skype'

# Team communication and collaboration software
cask 'slack'

# Plugin for AWS CLI to start and end sessions that connect to managed instances
cask 'session-manager-plugin'

# Open-source code editor
cask 'visual-studio-code'

# Multimedia player
cask 'vlc'

# GPU-accelerated cross-platform terminal emulator and multiplexer
cask 'wezterm'

# Video communication and virtual meeting platform
cask 'zoom'

# -----------------------------------'
# Installing formulae...
# -----------------------------------'

# Writes your git commit messages for you with AI
brew 'aicommits'

# Automatically restart SSH sessions and tunnels
brew 'autossh'

# Official Amazon AWS command-line interface
brew 'awscli'

# Microsoft Azure CLI 2.0
brew 'azure-cli'

# Clone of cat(1) with syntax highlighting and Git integration
brew 'bat'

# High performance key/value database
brew 'berkeley-db'

# Parser generator
brew 'bison'

# Resource monitor. C++ version and continuation of bashtop and bpytop
brew 'btop'

# Vi-like binary file (hex) editor
brew 'bvi'

# Create and view interactive cheat sheets for *nix commands
brew 'cheat'

# GNU File, Shell, and Text utilities
brew 'coreutils'

# Top-like interface for container metrics
brew 'ctop'

# Diff that understands syntax
brew 'difftastic'

# Load/unload environment variables based on $PWD
brew 'direnv'

# Terminal visual disk space navigator
brew 'diskonaut'

# Tool for exploring each layer in a docker image
brew 'dive'

# Text processing system for reStructuredText
brew 'docutils'

# SOCKS client wrapper for *BSD/macOS
brew 'dsocks'

# More intuitive version of du in rust
brew 'dust'

# Perl lib for reading and writing EXIF metadata
brew 'exiftool'

# Modern, maintained replacement for ls
brew 'eza'

# Simple, fast and user-friendly alternative to find
brew 'fd'

# Identify or delete duplicate files
brew 'fdupes'

# Play, record, convert, and stream audio and video
brew 'ffmpeg'

# Command-line downloader for image-hosting site galleries and collections
brew 'gallery-dl'

# Remote repository management made easy
brew 'ghq'

# Distributed revision control system
brew 'git'

# Syntax-highlighting pager for git and diff output
brew 'git-delta'

# Git extension for versioning large files
brew 'git-lfs'

# Render markdown on the CLI
brew 'glow'

# Open source programming language to build simple/reliable/efficient software
brew 'go'

# Open-source build automation tool based on the Groovy and Kotlin DSL
brew 'gradle'

# Make JSON greppable
brew 'gron'

# Bash and zsh history suggest box
brew 'hstr'

# Tools and libraries to manipulate images in many formats
brew 'imagemagick'

# Lightweight and flexible command-line JSON processor
brew 'jq'

# Kubernetes CLI To Manage Your Clusters In Style!
brew 'k9s'

# Anti-bikeshedding Kotlin linter with built-in formatter
brew 'ktlint'

# Sophisticated file transfer program
brew 'lftp'

# Portable Foreign Function Interface library
brew 'libffi'

# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew 'libfido2'

# C XSLT library for GNOME
brew 'libxslt'

# Clone of ls with colorful output, file type icons, and more
brew 'lsd'

# Mac App Store command-line interface
brew 'mas'

# Polyglot runtime manager (asdf rust clone)
brew 'mise'

# Lightweight PDF and XPS viewer
brew 'mupdf-tools'

# Interactive cheatsheet tool for the command-line
brew 'navi'

# NCurses Disk Usage
brew 'ncdu'

# Network grep
brew 'ngrep'

# HTTP load generator, inspired by rakyll/hey with tui animation
brew 'oha'

# Open client for Cisco AnyConnect VPN
brew 'openconnect'

# Command-line tool to generate, analyze, convert and manipulate colors
brew 'pastel'

# PDF processor written in Go
brew 'pdfcpu'

# Simplistic interactive filtering tool
brew 'peco'

# Parallel versions of OpenSSH and related tools
brew 'pssh'

# Rsync for cloud storage
brew 'rclone'

# Wrapper around ripgrep that adds multiple rich file types
brew 'ripgrep-all'

# Safe, concurrent, practical language
brew 'rust'

# SOund eXchange: universal sound sample translator
brew 'sox'

# Cross-shell prompt for astronauts
brew 'starship'

# Tail multiple Kubernetes pods & their containers
brew 'stern'

# User interface to the TELNET protocol
brew 'telnet'

# Tool to build, change, and version infrastructure
brew 'terraform'

# Simplified and community-driven man pages
brew 'tldr'

# Program that allows you to count code, quickly
brew 'tokei'

# Video processing framework with simplicity in mind
brew 'vapoursynth'

# Vi 'workalike' with many additional features
brew 'vim'

# Internet file retriever
brew 'wget'

# Library to create, extract, and modify Windows Imaging files
brew 'wimlib'

# HTTP benchmarking tool
brew 'wrk'

# Friendly and fast tool for sending HTTP requests
brew 'xh'

# PDF viewer
brew 'xpdf'

# Fast CSV toolkit written in Rust
brew 'xsv'

# Feature-rich command-line audio/video downloader
brew 'yt-dlp'

# UNIX shell (command interpreter)
brew 'zsh'

# -----------------------------------'
# Installing mas(Mac app store)...
# -----------------------------------'

mas '辞書 by 物書堂', id: 1380563956

mas 'Xcode', id: 497799835

mas 'Disk Space Analyzer', id: 446243721

mas 'HEIC Converter', id: 1294126402

mas 'TextSniper', id: 1528890965

mas 'TEPRA LINK 2', id: 1614816445

mas 'TEPRA SMA3', id: 704088911

mas 'LINE', id: 539883307

mas 'Amphetamine', id: 937984704

mas 'WattsConnected', id: 1639692859
